[
    {
        "id": "wt4907794",
        "name": "Sony - Alpha a7 III Mirrorless [Video] Camera with FE 28-70 mm F3.5-5.6 OSS Lens -",
        "brand": "Sony",
        "category": "Camera and Photography",
        "typeDescription": "Capture stunning portraits and beautiful action shots with this Sony a7 III full-frame mirrorless camera with FE 28-70mm standard zoom lens",
        "description": "Optical SteadyShot image stabilization delivers blur-free, crisp images, while the seven-blade circular aperture delivers more natural-looking bokeh effects. With its dust- and moisture-resistant design, this camera is ideal for both indoor and outdoor photo shoots.",
        "imageUrls": [],
        "price": 1999.99,
        "specifications": {
            "Image Sensor Size ": "35mm Full Frame (36 x 24 mm)",
            "Effective Pixels": "24.2 megapixels",
            "Video Resolution": "4K (2160p)",
            "Autofocus": "Yes",
            "Shutter Speeds": "Still images: 1/8000 to 30 sec, Bulb; Movies: 1/8000 to 1/4 (1/3 steps); up to 1/60 in AUTO mode (up to 1/30 in Auto slow shutter mode)",
            "Shooting Modes": "AUTO (iAuto), Programmed AE (P), Aperture priority (A), Shutter-speed priority (S), Manual (M), Movie modes",
            "Minimum Focal Length ": "28 millimeters",
            "Maximum Focal Length": "70 millimeters",
            "color": "Black"
        },
        "averageRating": 2.46,
        "totalRating": 212,
        "allReviews": [
            {}
        ]
    },

    {
        "id": "wt5832069",
        "name": "Nikon - COOLPIX B500 16.0-Megapixel Digital Camera ",
        "brand": "Nikon",
        "category": "Camera and Photography",
        "typeDescription": "Capture vivid, high-quality images with this Nikon Coolpix camera. Automated scene modes frame images in many shooting conditions,",
        "description": " while its 40x zoom provides powerful zoom capabilities for its compact size. This Nikon Coolpix camera is powered by AA batteries, letting you take it on the go, and it can share and transfer images via Bluetooth.Video mode Records 1080p Full HD movie clips up to 30 fps with stereo sound. Lens-Shift Vibration Reduction (VR) technology Counteracts camera shake to keep your shots steady and sharp.  Full range of scene modes Provides wide range of shooting mode (includes backlighting, bird watching, close up, panorama  fireworks, food, night landscape, portrait, sport, sunset etc).Video mode Records 1080p Full HD movie clips up to 30 fps with stereo sound. Lens-Shift Vibration Reduction (VR) technologyCounteracts camera shake to keep your shots steady and sharp.Full range of scene modesProvides wide range of shooting mode (includes backlighting, bird watching, close up, panorama, fireworks, food, night landscape, portrait, sport, sunset etc)..",
        "imageUrls": [],
        "price": 349.99,
        "specifications": {
            "Image Sensor Size ": "1/2.5” (5.76 x 4.29 mm)",
            "Effective Pixels": "16 megapixels",
            "Video Resolution": "Full HD (1080p",
            "Autofocus": "Yes",
            "Shutter Speeds": "All modes: from 1/1500 sec. to 1 sec.; for maximum speed during high-speed continuous shooting: 1/4000 sec.; for Star trails in Multiple Exposure Lighten Scene Mode: 25 sec.",
            "Shooting Modes": "Backlighting, bird watching, beach, close up, dusk/dawn, easy panorama, fireworks show, food, landscape, moon, night landscape, night portrait, party/indoor, pet portrait, portrait, scene auto selector, short movie show, snow, sports, sunset",
            "Minimum Focal Length ": "N/A millimeters",
            "Maximum Focal Length": "N/A millimeters",
            "color": "Black"
        },
        "averageRating": 4.0,
        "totalRating": 533,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt8524380",
        "name": "Canon - EOS Rebel T7 DSLR Video Two Lens Kit",
        "brand": "Canon",
        "category": "Camera and Photography",
        "typeDescription": "Take stunning pictures with vibrant colors using this EOS Rebel T7 camera. The built-in Wi-Fi makes printing and sharing pictures quick and easy, and the auto-focus system creates crisp images at a moment's notice. This EOS Rebel T7 camera takes Full HD video, allowing experiences to be captured with quality..,",
        "description": "EF-S 18-55mm f/3.5-5.6 standard zoom provides versatility . Designed with Canon's optical image stabilizer technology. Expands picture-taking possibilities any time slow shutter speeds are needed..EF 75-300mm f/4-5.6 4x telephoto zoom lens to entry into telephoto photography Well-suited for sports and other applications requiring fast AF. A DC motor is used to power the AF.24 1-megapixel CMOS (APS-C) sensor delivers incredible detail and gorgeous enlargements The large sensor helps the camera perform superbly even in low light, giving you the chance to capture amazing results in a variety of conditions.",
        "imageUrls": [],
        "price": 599.99,
        "specifications": {
            "Image Sensor Size ": "APS-C (22.2 x 14.8 mm)",
            "Effective Pixels": "24.1 megapixels",
            "Video Resolution": "Full HD (1080p",
            "Autofocus": "Yes",
            "Shutter Speeds": "N/A",
            "Shooting Modes": "Scene intelligent auto, flash off, creative auto, landscape, close-up, sports, food, night portrait, portrait, P, Tv, Av, M, with flash, with bulb exposures",
            "Minimum Focal Length ": "18 millimeters",
            "Maximum Focal Length": "55 millimeters",
            "color": "Black"
        },
        "averageRating": 4.60,
        "totalRating": 66,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt3528093",
        "name": "Canon - EOS RP Mirrorless Camera with RF 24-105mm f/4-7.1 IS STM Lens",
        "brand": "Canon",
        "category": "Camera and Photography",
        "typeDescription": "The EOS RP and RF24-105mm F4-7.1 IS STM lens kit is a compact and lightweight RF-series kit that offers a versatile zoom range",
        "description": "capturing different subjects with ease. For macro enthusiasts, the EOS RP and RF24-105mm F4-7.1 IS STM lens kit is particularly advantageous, offering an impressive maximum magnification of 0.5x using Center Macro Focus - helping you snap photos from as close as one inch away. Your images and videos will remain clear and steady, too, thanks to a leadscrew-type STM motor that enables smooth autofocusing and optical image stabilization with up to five stops of shake correction. And, with a control ring that allows for quick setting changes, including shutter speed and aperture, the EOS RP and RF24-105mm F4-7.1 IS STM lens kit puts quality, convenience, and control in your hands, making it perfect duo for everyday use.",
        "imageUrls": [],
        "price": 1299.99,
        "specifications": {
            "Image Sensor Size ": "35mm Full Frame (36 x 24 mm)",
            "Effective Pixels": "26.2 megapixels",
            "Video Resolution": "4K (2160p)",
            "Autofocus": "Yes",
            "Shutter Speeds": "1/4000 - 30 sec.",
            "Shooting Modes": "Scene Intelligent Auto, Flexible-priority AE (Fv), Program AE (P), Shutter-priority AE (Safety shift possible) (Tv), Aperture-priority AE (Safety shift possible) (Av), Manual exposure (M), Bulb, Custom shooting mode C1, C2, C3",
            "Minimum Focal Length ": "24 millimeters",
            "Maximum Focal Length": "105 millimeters",
            "color": "Black"
        },
        "averageRating": 4.03,
        "totalRating": 321,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt6711936",
        "name": "Canon - EOS Rebel T8i DSLR Camera with EF-S 18-55mm Lens - Black",
        "brand": "Canon",
        "category": "Camera and Photography",
        "typeDescription": "Never miss a moment of the action with this Canon EOS Rebel digital camera kit. The wide sensitivity range is ideal for use in almost all lighting conditions, while the 45-point face-detection autofocus system ensures high-quality images. This Canon EOS Rebel digital camera kit features built-in Bluetooth and Wi-Fi connectivity for effortless transfer of your raw files to compatible smart devices.e",
        "description": "EF-S 18-55mm f/4-5.6 IS STM standard zoom lens Offers a versatile zoom range and quiet operation for power on the go, and its quality image stabilization can result in sharper photographs with minimal blur, even in low-light conditions.24.1MP APS-C CMOS sensor delivers amazing detail and gorgeous enlargements Create enlargements all the way up to poster-size prints, or crop aggressively to frame a perfect shot in glorious detail.100-25,600 ISO range for crisp, clear photographs even in ultralow light  Enhances shooting in varied and quick-changing lighting situations.",
        "imageUrls": [],
        "price": 899.99,
        "specifications": {
            "Image Sensor Size ": "APS-C (22.2 x 14.8 mm)",
            "Effective Pixels": "24.1 megapixels",
            "Video Resolution": "4K (2160p)",
            "Autofocus": "Yes",
            "Shutter Speeds": "1/4000 to 30 sec, bulb (optical viewfinder and live view shooting); 1/4000 to 1/8 sec. (movie recording)",
            "Shooting Modes": "N/A",
            "Minimum Focal Length ": "18 millimeters",
            "Maximum Focal Length": "55 millimeters",
            "color": "Black"
        },
        "averageRating": 4.73,
        "totalRating": 88,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt3464301",
        "name": "Sony - Alpha ZV-E10 Kit Mirrorless Vlog Camera with 16-50mm Lens",
        "brand": "Sony",
        "category": "Camera and Photography",
        "typeDescription": " The ZV-E10 features a large sensor with E-mount interchangeable lens options for a wide selection of lenses,flip-out vari-angle LCD,  advanced audio options and features specifically designed for vlogging.",
        "description": "The Background Defocus features lets you simply press a single button to turn background blurring (bokeh) on and off. A defocused background highlights you or your subject, while having everything in focus is great for showing a location or setting.With the press of a button, you can activate the ZV-E10’s Product Showcase Setting. When activated, when you hold a product in front of the camera the focus will shift to that object, then back to your face when product moves out of frame.Even when lighting conditions change, the ZV-E10 makes sure that you'll always be brightly lit. From direct sunlight and backlit angles to shadows and dimly lit interior corners, the camera detects the subject's face and automatically handles changes in brightness..",
        "imageUrls": [],
        "price": 799.99,
        "specifications": {
            "Image Sensor Size ": "APS-C (22.2 x 14.8 mm)",
            "Effective Pixels": "24.2 megapixels",
            "Video Resolution": "4K (2160p)",
            "Autofocus": "Yes",
            "Shutter Speeds": "N/A",
            "Shooting Modes": "Portrait, Sports Action, Macro, Landscape, Sunset, Night Scene, Hand-held Twilight, Night Potrait, Anti Motion Blur",
            "Minimum Focal Length ": "16 millimeters",
            "Maximum Focal Length": "50 millimeters",
            "color": "Black"
        },
        "averageRating": 3.0,
        "totalRating": 533,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt8765154",
        "name": "Sony - Alpha a6000 Mirrorless Camera with 16-50mm Retractable Lens ",
        "brand": "Sony",
        "category": "Camera and Photography",
        "typeDescription": " Sony Alpha a6000 Mirrorless Camera with 16–50mm Retractable Lens: Start capturing realistic images and HD video footage for yourself or your clients with the Sony Alpha a6000, which features a 24.3-megapixel Exmor CMOS sensor and comes with a 16–50mm lens that's lightweight for easy transport. When you're all set, just connect your devices via the camera's built-in Wi-Fi to share photos with loved ones. .",
        "description": "16–50mm Power Zoom lens included  Start capturing sharp, detailed photos and videos right away. Features ED and aspherical elements.24.3-megapixel Exmor APS-C CMOS sensor delivers vividly detailed images Capture high-resolution images up to 6000 x 4000 pixels.ISO 100–25,600 for stills, plus ISO 100–12,800 for movies  Enjoy crisp, clean images over a broad spectrum of lighting conditions. Never miss a shot with ultrafast 11 fps (frames per second) From joyous facial expressions to fast-paced sports action, burst mode ensures you get the shot even if it only lasts a fraction of a second.3 color TFT display makes it easy to review photos and videos Look at stored footage before you print or share.",
        "imageUrls": [],
        "price": 649.99,
        "specifications": {
            "Image Sensor Size ": "APS-C (23.6 x 15.7 mm)",
            "Effective Pixels": "24.3 megapixels",
            "Video Resolution": "Full HD (1080p)",
            "Autofocus": "Yes",
            "Shutter Speeds": "1/4000 - 30 sec.",
            "Shooting Modes": "Portrait, Sports Action, Macro, Landscape, Sunset, Night Scene, Hand-held Twilight, Night Potrait, Anti Motion Blur",
            "Minimum Focal Length ": "16 millimeters",
            "Maximum Focal Length": "50 millimeters",
            "color": "Black"
        },
        "averageRating": 4.7,
        "totalRating": 4432,
        "allReviews": [
            {}
        ]
    },
  
    {
        "id": "wt7357292",
        "name": "Nikon - Z50 Mirrorless Camera Two Lens Kit with NIKKOR Z DX 16-50mm f/3.5-6.3 VR and NIKKOR Z ",
        "brand": "Nikon",
        "category": "Camera and Photography",
        "typeDescription": " Tell your story creatively with this Nikon Z50 mirrorless digital camera kit. The included 15-60mm and 50-250mm VR lenses in this kit let you capture a variety of scenes, while the 20.9MP sensor delivers high-speed performance and superior image quality. Built-in Wi-Fi and Bluetooth ensure easy sharing of photos and videos. This Nikon Z50 mirrorless digital camera kit is compact and lightweight for portability..",
        "description": "NIKKOR Z DX 16-50mm f/3.5-6.3 VR and 50-250mm f/4.5-6.3 VR lenses Feature a versatile zoom range and VR image stabilization, ideal for wide-angle shots, portraits, fast-action, HD video, and enhanced low-light capabilities. 20.9MP CMOS sensor delivers vividly detailed, high-resolution images Captures high-resolution images up to 5568 x 3712 pixels.ISO 100-51,200 (expandable to 204,800) for crisp, clear photos even in ultralow lightEnhances shooting in varied and fast-changing lighting situations, including extremely low light. Never miss a shot with 11 fps (frames per second)From joyous facial expressions to fast-paced sports action, burst mode ensures you get the shot even if it only lasts a fraction of a second.",
        "imageUrls": [],
        "price": 1249.99,
        "specifications": {
            "Image Sensor Size ": "APS-C (23.6 x 15.7 mm)",
            "Effective Pixels": "20.9 megapixels",
            "Video Resolution": "4K (2160p)",
            "Autofocus": "Yes",
            "Shutter Speeds": "1/4000 to 30 sec.",
            "Shooting Modes": "N/A",
            "Minimum Focal Length ": "16 millimeters",
            "Maximum Focal Length": "50 millimeters",
            "color": "Black"
        },
        "averageRating": 4.70,
        "totalRating": 87,
        "allReviews": [
            {}
        ]
    },
  
    {
        "id": "wt8502572",
        "name": "Nikon - D7500 DSLR 4K Video Two Lens Kit with 18-55mm and 70-300mm Lenses ",
        "brand": "Nikon",
        "category": "Camera and Photography",
        "typeDescription": "Born from a desire for flagship performance and innovation in a more compact and streamlined connected camera,",
        "description": "the D7500 delivers the game-changing resolution, ISO range, image processing and energy efficiency of the award-winning D500 in an enthusiast-level DSLR. Simply put, the D7500 is built to outperform any camera in its class with top-tier image quality, blazing speed, flawless autofocus, 4K Ultra HD video and pro-grade creative tools - all in a comfortable, rugged design. This is a camera for the generation of creators.The D7500 uses the same 20.9 MP DX-format image sensor and EXPEED 5 image processing engine as the D500, taking your photos and videos to the next level. Capture with phenomenal sharpness and tonality, especially in low light situations like concerts, sporting events, parties and events..",
        "imageUrls": [],
        "price": 1399.99,
        "specifications": {
            "Image Sensor Size ": "APS-C (23.6 x 15.7 mm)",
            "Effective Pixels": "20.9 megapixels",
            "Video Resolution": "4K (2160p)",
            "Autofocus": "Yes",
            "Shutter Speeds": "30 - 1/8000",
            "Shooting Modes": "Autumn color; landscape; portrait mode; close-up; party/indoor; beach/snow; night portrait; children; food; night landscape; dawn/dusk; sports mode; sunset; candle; blossom; pet portrait",
            "Minimum Focal Length ": "18 millimeters",
            "Maximum Focal Length": "50 millimeters",
            "color": "Black"
        },
        "averageRating": 4.8,
        "totalRating": 2000,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt4144651",
        "name": "Nikon - Z fc 4K Video Mirrorless Camera w/ NIKKOR Z DX 16-50mm f/3.5-6.3 VR",
        "brand": "Nikon",
        "category": "Camera and Photography",
        "typeDescription": "The Z fc mirrorless camera features a classic, tactile design fused with modern Z series technology. Equipped with a flip out vlogger screen, this DX-format 4K UHD compact camera delivers big image quality for photos and videos.",
        "description": "NIKKOR Z DX 16-50mm f/3.5-6.3 VR - Silver Standard zoom lensGreat for everyday shots, including everything from gorgeous landscapes to exceptional close-ups. 20.9MP CMOS sensor delivers vividly detailed, high-resolution images Captures high-resolution images up to 5568 x 3712 pixels.ISO 100-51,200 (expandable to 204,800) for crisp, clear photos even in ultralow light Enhances shooting in varied and fast-changing lighting situations, including extremely low light.Never miss a shot with 11 fps (frames per second) From joyous facial expressions to fast-paced sports action, burst mode ensures you get the shot even if it only lasts a fraction of a second.209-point auto focusSubjects are acquired quickly when they enter the frame and tracked throughout the frame, even to the far edgesCapture spectacular movies in 4K Ultra HDThe choice of frame rates includes 30p, 25p, or 24p.",
        "imageUrls": [],
        "price": 1099.99,
        "specifications": {
            "Image Sensor Size ": "APS-C (23.6 x 15.7 mm)",
            "Effective Pixels": "20.9 megapixels",
            "Video Resolution": "4K (2160p)",
            "Autofocus": "Yes",
            "Shutter Speeds": "3 Shutter-speed dial: 1/4000 to 4 s (1 step), Bulb, Time, X (Flash sync). Main command dial: 1/4000 to 30 s (1/3 step, can be extended up to 900 s in mode M), Bulb, Time, X (Flash sync)",
            "Shooting Modes": " Auto, P: programmed auto with flexible program, S: shutter-priority auto, A: aperture-priority auto, M: manual",
            "Minimum Focal Length ": "18 millimeters",
            "Maximum Focal Length": "50 millimeters",
            "color": "Black"
        },
        "averageRating": 5.0,
        "totalRating": 46,
        "allReviews": [
            {}
        ]
    }
  
    
]