[
    {
        "id": "wt318142729",
        "name": "Hp Notebook 250 G8 Laptop Intel Celeron 15.6'' 4GB RAM, 500GB HDD Win 10 - Silver",
        "brand": "HP",
        "category": "Laptops",
        "typeDescription": "Lovely and light With a thin and light build, the HP 250 Laptop keeps up with mobile workstyles. The lovely show, with its narrow border design and large screen-to-body-ratio, offers plenty of space for work or watching videos.",
        "description": "With a USB Type-C data port, an RJ-45 port, and an HDMI port, this laptop is able to connect to all of your peripherals and is built to meet the needs of business. Get connected with the HP 250 G8 Notebook PC laptop with powerful technology and a streamlined chassis that’s easy to take everywhere you go. Complete business tasks with an Intel® processor and essential collaboration tools.",
        "imageUrls": [],
        "price": 309.28,
        "specifications": {
            "Proccessor:": "Intel Celeron",
            "RAM": "4 GB DDR4 RAM",
            "Storage": "500 GB HDD",
            "Graphic Card": "Intel UHD Graphics 600",
            "Display Size": "15.6 inch Display",
            "Color": "Silver"
        },
        "averageRating": 4.50,
        "totalRating": 46,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt36234548",
        "name": "Hp Intel Pentium Gold, 512GB SSD, 4GB RAM,15.6 HD - Scarlet Red",
        "brand": "HP",
        "category": "Laptops",
        "typeDescription": "This attractive HP laptop features a 15.6 good and attractive colour display, thanks to which users can enjoy vivid & crisp images anytime anywhere. To satisfy the needs of entertainment lovers, the laptop is equipped with dual speakers.",
        "description": "Redefine your professional experience using the HP Pavilion 15 inch laptop that has been specially engineered to meet your business needs. The Pavilion 15 PC from HP guarantees complete customer satisfaction and offers you a portable way to stay updated with your assignments and presentations even when you are on the go. Bid farewell to the conventional bulky desktop models and bring perfection and portability home with this exclusive HP Notebook PC..",
        "imageUrls": [],
        "price": 349.75,
        "specifications": {
            "Proccessor:": "Intel Pentium Gold",
            "RAM": "4 GB DDR4 RAM",
            "Storage": "512 GB SSD",
            "Graphic Card": "Intel UHD Graphics 600",
            "Display Size": "15.6 inch Display",
            "Color": "Scarlet Red"
        },
        "averageRating": 3.20,
        "totalRating": 424,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt50723269",
        "name": "Hp Envy X360 2 In 1 13.3 Touch Screen Evo Core i7 8GB Ram 512GB SSD Win 10 - Natural Silver",
        "brand": "HP",
        "category": "Laptops",
        "typeDescription": "The power to bring your creations to life: With an 11th Gen Intel® Core™ processor, a long battery life, ample PCIe SSD storage and HP Command Center, you get performance to meet your creative needs.",
        "description": "Thoughtfully designed: Ideas come to life in accurate color with the high definition, micro-edge display. The 360 degree hinge adapts so you can use touch and pen input at the same time to capture every intricate sketch with complete precision. Thoughtfully designed: Designed for creators. Watch your ideas come to life in vibrant, accurate color with the 4-way, FHD micro-edge touch display. The 360 degree hinge adapts so you can use touch and pen input at the same time to capture every intricate sketch with complete precision anytime, anywhere. For an extra creative edge, add an additional display with support up to 5K resolution. ",
        "imageUrls": [],
        "price": 918.40,
        "specifications": {
            "Proccessor:": "11th Gen Intel® Core™ i7 processor",
            "RAM": "8 GB Memory",
            "Storage": "512 GB SSD",
            "Graphic Card": "Intel® Iris® Plus Graphics",
            "Display Size": "13.3 inch Display - Touch screen",
            "Color": "Silver"
        },
        "averageRating": 3.0,
        "totalRating": 482,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt22568495",
        "name": "Hp EliteBook Core i5 8gb Ram 512gb SSD 11th Gen Silver",
        "brand": "HP",
        "category": "Laptops",
        "typeDescription": "The HP EliteBook 840 is built for how you work with a new AI-based audio experience",
        "description": "This easy to carry ultralight and thin business PC comes with an 85-percent screen-to-body ratio and a quiet and comfortable keyboard to work on.Comfortability HP Wolf Security for Business creates a hardware-enforced, always-on, resilient defense. From the BIOS to the browser,above, in, and below the OS, these constantly evolving solutions help protect your PC from modern threats. ",
        "imageUrls": [],
        "price": 1389.14,
        "specifications": {
            "Proccessor:": "Intel Core i5 11th Generationr",
            "RAM": "8 GB Memory",
            "Storage": "512 GB SSD",
            "Graphic Card": "Intel® Iris® Plus Graphics",
            "Display Size": "14 inches diagonal Full HD Screen",
            "Color": "Silver"
        },
        "averageRating": 3.40,
        "totalRating": 600,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt34902477",
        "name": "Hp Elite X2 Core i5 16gb RAM 256GB SSD Silver(Refurbished)",
        "brand": "HP",
        "category": "Laptops",
        "typeDescription": "Hp Elite X2 G2 Detachable 2 in 1 business tablet laptop is a brilliant piece of architecture and engineering that lets you use it both as a laptop and a tablet.",
        "description": "Optimized for collaboration and engineered to accelerate the pace of modern business, this 12.3 Elite x2 1012 G2 Multi-Touch 2-in-1 Tablet from HP adapts to your needs, helping to provide connections from almost anywhere in the world with PC-level performance. It is powered by a 2.5 GHz Intel Core i5-7200U processor and 16GB RAM, allowing you to run multiple programs simultaneously and quickly access frequently used files and programs.",
        "imageUrls": [],
        "price": 629.04,
        "specifications": {
            "Proccessor:": "Intel Core i5 7th Generation",
            "RAM": "16 GB Memory",
            "Storage": "256 GB SSD",
            "Graphic Card": "Intel HD Graphics 620",
            "Display Size": "12.3 inches Full HD Screen",
            "Color": "Silver"
        },
        "averageRating": 2.0,
        "totalRating": 5,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt92375334",
        "name": "DELL Vostro 15 3500 Core™ i3 -1115G4 4GB 1TB 15.6 Win 10 - Black",
        "brand": "DELL",
        "category": "Laptops",
        "typeDescription": "Available with Windows 10 Pro – lets you focus on running your business instead of your IT.",
        "description": "Travel light: As light as 3.93lb less than 0.8 inches, the new and improved Vostro 15 3500 is ready to go whenever you are.  Ports galore: Your laptop is equipped with an array of ports and an SD card reader to keep you connected to what matters most, plus a USB Type-C port for quick and easy data transfers.* Numeric keypad: Get work done faster with a 10-key numeric pad and a calculator key that populates a calculator with just one touch.",
        "imageUrls": [],
        "price": 450.81,
        "specifications": {
            "Proccessor:": "1th gen Intel® Core™ i3",
            "RAM": "4GB DDR4-SDRAM",
            "Storage": "1000 GB HDD",
            "Graphic Card": "Intel® UHD Graphics",
            "Display Size": "15.6 inches HD Screen",
            "Color": "black"
        },
        "averageRating": 4.20,
        "totalRating": 25,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt66759191",
        "name": "DELL Refurbished Dell Mini - 2GB Ram 250GB - Black",
        "brand": "DELL",
        "category": "Laptops",
        "typeDescription": "This is a reliable and affordable mini laptop with  10.1 Screen . Its robust with  Intel  processor, Storage - 250GB HDD and 2GB RAM Memory.  ",
        "description": "Dell Latitude 2100/2110/2120 Netbook PC. Keep your productivity high with this budget friendly Dell Netbook. The Netbook is exceptionally rugged and very capable of standing up to the rigors of the full day in the classroom. Get online quickly with the built-in Gigabit Ethernet port. This laptop is rugged, dependable and infused with Wifi to get you online wireless at home, in class or your favorite local park.",
        "imageUrls": [],
        "price": 104.71,
        "specifications": {
            "Proccessor:": "1th gen Intel® Core™ i3",
            "RAM": "2GB RAM ",
            "Storage": "256 GB HDD",
            "Graphic Card": "Unknown",
            "Display Size": "10.1 inches ",
            "Color": "black"
        },
        "averageRating": 3.0,
        "totalRating": 32,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt27834324",
        "name": "Lenovo Thinkpad Refurbished Lenovo X260 Intel core i5 4GB/500GB HDD 13 Inch",
        "brand": "Lenovo",
        "category": "Laptops",
        "typeDescription": "Freedom from dongles is a real leg up. There’s something to be said for all of your essential ports being there without add-ons that you have to carry in a bag. The freedom to issue PCs to people that aren’t always careful with their things is important, too.",
        "description": "The X260 passes Military-specification testing for durability and reliability. With a sleek appearance and weight of less than 1.36 kg, it runs counter to chunkiness often associated with sturdiness. Its IPS LCD delivers brilliant brightness and viewing angles of almost 180 degrees. One interesting feature of the X260 is the Power Bridge technology, which allows users to swap batteries without turning off the device..",
        "imageUrls": [],
        "price": 314.52,
        "specifications": {
            "Proccessor:": "intel core i5 , 6th generation",
            "RAM": "4GB RAM ",
            "Storage": "500 GB HDD",
            "Graphic Card": "Unknown",
            "Display Size": "12.5 inches ",
            "Color": "black"
        },
        "averageRating": 4.20,
        "totalRating": 45,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt30694618",
        "name": "Lenovo Thinkpad Refurbished T460s 14: ",
        "brand": "Lenovo",
        "category": "Laptops",
        "typeDescription": "BUSINESS-READY, HIGHLY MOBILE 14 ULTRABOOK™ The new standard for highly mobile Ultrabooks™.",
        "description": "Thinner and lighter than previous generations, it also has added features for robust business productivity. The T460 features customizable storage options, immersive audio, and all-day battery life.Thinner and lighter than ever, The T460s is built for robust business productivity. Power and performance with i5 processor. The 14 HD display provides impressive visual with clear images and bright colors.",
        "imageUrls": [],
        "price": 266.52,
        "specifications": {
            "Proccessor:": "intel core i5 , 6th generation",
            "RAM": "8GB RAM ",
            "Storage": "256 GB SSD",
            "Graphic Card": " HD Graphics 520,",
            "Display Size": "  14.0 HD Display ",
            "Color": "black"
        },
        "averageRating": 4.0,
        "totalRating": 70,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt80283680",
        "name": "Acer V5 /Travelmate.4GB RAM 500GB, 12Inches,4-6 Hrs - Black(Refurbished)",
        "brand": "Acer",
        "category": "Laptops",
        "typeDescription": "Acer Aspire One V5/ travelmate..is a high performing laptop that will make it easy for you to get task done on time. This lightweight laptop is what you need.",
        "description": "its portable size means it will be very convenient for you to move around. It will fit well into you’re your bag without taking up much space. The laptop will support your active lifestyle, as you will be able to work even while on the move. Display Acer aspire 0ne/travelmate- is equipped with excellent LED 12inch display HD panel to have u equipped with excellent best vision of any mini laptop available in the market. Aspire One has an ultra-slim design, and it is powered by a highly efficient Dual.",
        "imageUrls": [],
        "price": 150.97,
        "specifications": {
            "Proccessor:": "Uknown",
            "RAM": "4GB RAM ",
            "Storage": "500 GB HDD",
            "Graphic Card": " HD Graphics 520,",
            "Display Size": "12inch display  panel ",
            "Color": "black"
        },
        "averageRating": 3.40,
        "totalRating": 435,
        "allReviews": [
            {}
        ]
    }
]