[
    {
        "id": "wt7667233",
        "name": "Samsung - Galaxy A13 32GB (Unlocked) - Black",
        "brand": "SAMSUNG",
        "category": "Smart Phones",
        "typeDescription": "Your busy life deserves a battery built for busy; Whether you’re taking a video call on your commute, catching up on your favorite show or with friends and family, your long-lasting, super fast charging battery* has your back",
        "description": "POWERFUL PERFORMANCE: The very best of Galaxy A Series gives you awesomely smooth streaming of your favorite content with the most powerful performance in its series and awesomely fast speeds to download shows and movies — all at the speed of 5G** EXPANDABLE STORAGE Galaxy A53 5G*** gives you the A Series’ biggest built-in storage and lets you enjoy more memories and entertainment; With an additional 1TB of expandable storage with a microSD card****, you can hold on to every smile and relive every epic vacay",
        "imageUrls": [],
        "price": 189.99,
        "specifications": {
            "Screen Size": "6.6 inch Display",
            "Operating System:": "Android 12",
            "Internal Memory": "32 GB",
            "Phone Memory (RAM)": "3 GB",
            "Front-Facing Camera": "8 megapixels",
            "Rear-Facing Camera": "50 megapixels",
            "Processor Model ": "Exynos 850",
            "Battery Life": "Non-Removable 5000mAh",
            "color": "Black"
        },
        "averageRating": 4.0,
        "totalRating": 232,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt7013787",
        "name": "Samsung - Galaxy S10+ Unlocked Cell Phone - Pre-Owned ",
        "brand": "SAMSUNG",
        "category": "Smart Phones",
        "typeDescription": "The 10th generation of Samsung Galaxy lets you do more and do it better.",
        "description": "The new Samsung Galaxy S10+ offers premium experience with the nearly bezel-less 6.4-inch QHD+ Cinematic Infinity Display. A ridiculously power camera, 5 total! With 3 Rear-Facing Cameras and an amazing In-Display Dual Front Portrait Camera, capture the best ultra-wide shot or perfect selfie. Unlocked your device from any angle with the in-display Ultrasonic Fingerprint ID2 that unlocke in anylight and ifts seamlessly with your natural grip. Best of all, the Wireless PowerShare feature lets your wirelessly charge your Galaxy Buds, Galaxy Watch, or even a friend's Qi Wireless Charging Capable phone right from our device",
        "imageUrls": [],
        "price": 299.99,
        "specifications": {
            "Screen Size": "6.3 inch Display",
            "Operating System:": "Android 9.0 (Pie) ",
            "Internal Memory": "128 GB microSD, up to 1 TB",
            "Phone Memory (RAM)": "8 GB",
            "Front-Facing Camera": "18 megapixels",
            "Rear-Facing Camera": "5Triple Camera: 12 MP(f/1.5-2.4, Dual Pixel PDAF) & 12 MP(f/2.4, AF, OIS) & 16 MP(f/2.2, 12mm)",
            "Processor Model ": "Qualcomm Snapdragon 855,",
            "Battery Life": "Non-Removable 4100mAh",
            "color": "Prism Black"
        },
        "averageRating": 3.43,
        "totalRating": 322,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt2285376",
        "name": "Google - Pixel 6 Pro 128GB (Unlocked)",
        "brand": "GOOGLE",
        "category": "Smart Phones",
        "typeDescription": "Introducing Pixel 6 Pro, the completely redesigned, fully loaded Google 5G phone.* With a powerful camera system, next-gen security, and the custom-built Google Tensor processor, it’s the smartest and fastest Pixel yet.",
        "description": "The processor made for Pixel. Google Tensor is the first processor designed by Google, custom-made for Pixel with 12GB of RAM. You’ll notice the difference immediately. Pixel runs smoother, apps launch faster, and pages load quicker. And Pixel’s security chip helps protect your private data. Universal Unlocked Compatible with all major U.S. carriers, including Verizon, AT&T, Sprint and T-Mobile. Also compatible with prepaid carriers including Cricket Wireless, MetroPCS, Google Fi, Simple Mobile, Total Wireless, Tracfone, Net10, Mint, and H2O. A powerful new camera system. Capture finer details with a 50MP camera - including three pro-level lenses and a telephoto lens with 4x optical zoom.",
        "imageUrls": [],
        "price": 649.00,
        "specifications": {
            "Screen Size": "6.7 inch Display",
            "Operating System:": "Android 12 ",
            "Internal Memory": "128 GB",
            "Phone Memory (RAM)": "12 GB",
            "Front-Facing Camera": "11.1 megapixels",
            "Rear-Facing Camera": "50 megapixels",
            "Processor Model ": "Google Tensor chip",
            "Battery Life": "Non-Removable 5300mAh",
            "color": "Stormy Black"
        },
        "averageRating": 4.6,
        "totalRating": 21,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt1915298",
        "name": "Google - Pixel 6a 128GB (Unlocked) -",
        "brand": "GOOGLE",
        "category": "Smart Phones",
        "typeDescription": "Meet Pixel 6a, the more affordable Google phone that adapts to you. Powered by Google Tensor, it’s super fast and secure. The battery lasts up to 72 hours with Extreme Battery Saver.***** The Pixel Camera captures the moment just how you experienced it. And with TitanM2 security, protection is built right in.",
        "description": "Universal Unlocked Compatible with all major U.S. carriers, including Verizon, AT&T, Sprint and T-Mobile. Also compatible with prepaid carriers including Cricket Wireless, MetroPCS, Google Fi, Simple Mobile, Total Wireless, Tracfone, Net10, Mint, and H2O. Google puts the G in 5G. Download and upload videos super fast over 5G.* Watch movies, play games, and get stuff done when you’re on the go. Google Tensor helps you get things done fast.  Pixel is fast and responsive with the Google Tensor chip. Apps launch fast, pages and images load quickly, and everything runs smoothly. The brains behind Pixel 6a. Google Tensor makes Pixel 6a super smart, secure, and powerful. It’s the first chip designed by Google just for Pixel.",
        "imageUrls": [],
        "price": 299.00,
        "specifications": {
            "Screen Size": "6.1 inch Display",
            "Operating System:": "Android 12 ",
            "Internal Memory": "128 GB",
            "Phone Memory (RAM)": "6 GB",
            "Front-Facing Camera": "8 megapixels",
            "Rear-Facing Camera": "12 megapixels",
            "Processor Model ": "Google Tensor chip",
            "Battery Life": "Non-Removable 4410mAh",
            "color": "Charcoal"
        },
        "averageRating": 2.30,
        "totalRating": 100,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt2357786",
        "name": "Apple - Preowned iPhone X with 256GB Memory Cell Phone (Unlocked)",
        "brand": "Apple",
        "category": "Smart Phones",
        "typeDescription": "Stay connected with this preowned Apple iPhone X smartphone. The 5.8-inch Super Retina HD display and the ultrawide and telephoto cameras let you capture high-quality low-light photos, while Face ID enhances security. This slim gray Apple iPhone X smartphone has 256GB of space that handles lots of photos and videos.",
        "description": "Preowned This phone is guaranteed to be fully functional with some cosmetic blemishes. It comes in non-original packaging with a charger and data cable. A limited 90-day warranty is provided by CCR Warranty. To obtain technical or warranty assistance, contact CCR Warranty at 866-579-8436. SIM card is not included. Apple A11 Fusion chip with Neural Engine Delivers outstanding overall performance for opening and running applications, flipping through menus and more.  iOS 11 operating system  Reliable security combines with a seamless interface between your phone and a wide variety of Apple devices. Universal unlocked Compatible with all major U.S. carriers, such as Verizon, AT&T, Sprint, and T-Mobile. Also works with prepaid carriers, including Cricket Wireless, Boost Mobile, MetroPCS, Simple Mobile, Total Wireless, Tracfone, Net10, Mint, and H2O.",
        "imageUrls": [],
        "price": 349.99,
        "specifications": {
            "Screen Size": "5.8 inch Display",
            "Operating System:": "Apple iOS 11",
            "Internal Memory": "256 GB",
            "Phone Memory (RAM)": "4 GB",
            "Front-Facing Camera": "7 megapixels",
            "Rear-Facing Camera": "12 megapixels",
            "Processor Model ": "A11 Bionic chip ",
            "Battery Life": "Non-Removable 2716mAh",
            "color": "Space Gray"
        },
        "averageRating": 3.88,
        "totalRating": 44,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt4848320",
        "name": "Apple - Pre-Owned iPhone 11 64GB (Unlocked) ",
        "brand": "Apple",
        "category": "Smart Phones",
        "typeDescription": "Just the right amount of everything. A new dual‑camera system captures more of what you see and love. An all‑day battery life lets you do more and charge less. And high‑quality video, so your memories look better than ever. It just got a whole lot harder to take a bad photo. All‑new dual‑camera system",
        "description": "Take your photos from wide to ultra wide. A redesigned interface uses the new Ultra Wide camera to show you what’s happening outside the frame — and lets you capture it. Shoot and edit videos as easily as you do photos. It’s the world’s most popular camera, now with a whole new perspective. Shoot and edit high-quality video in a smartphone. iPhone 11 shoots beautifully sharp 4K video at 60 fps across all its cameras. The Ultra Wide camera captures four times more scene, so it’s perfect for action shots like your dog catching a frisbee. If you’re recording a performance — say, your kid’s piano recital — when you zoom in, the audio zooms too. And now you can edit videos as easily as you do photos. New Ultra Wide camera. Go big ",
        "imageUrls": [],
        "price": 429.99,
        "specifications": {
            "Screen Size": "6.1 inch Display",
            "Operating System:": "Apple iOS 13",
            "Internal Memory": "64 GB",
            "Phone Memory (RAM)": "4 GB",
            "Front-Facing Camera": "12 megapixels",
            "Rear-Facing Camera": "12 MP, f/1.8, 26mm (wide), 1/2.55, 1.4µm, dual pixel PDAF, OIS 12 MP, f/2.4, 120˚, 13mm (ultrawide), 1/3.6",
            "Processor Model ": "Apple A13 Bionic (7 nm+)",
            "Battery Life": "Non-Removable 3110mAh",
            "color": "Black"
        },
        "averageRating": 3.53,
        "totalRating": 3211,
        "allReviews": [
            {}
        ]
    },


    {
        "id": "wt6279420",
        "name": "OnePlus - 10 Pro 5G 8GB+128GB",
        "brand": "OnePlus",
        "category": "Smart Phones",
        "typeDescription": "The OnePlus 10 Pro is “ultra” in every aspect. Capture breath-taking photos and videos with the new OnePlus Billion Color Solution, an even wider 150° Ultra-Wide Camera, and more.",
        "description": "The 6.7” QHD+ display portrays stunning colors for all viewing content, and also adjusts dynamically from 1Hz up to 120Hz, giving you a silky-smooth user experience. Equipped with the latest Snapdragon 8th Gen Mobile Platform and the new HyperBoost Gaming Engine, the OnePlus 10 Pro will be one of the most powerful phones for mobile gaming. Say goodbye to battery anxiety with a 65W Fast Charging (wired) or 50W Wireless Charging, getting you a day’s power in 15 minutes. Simply put, the OnePlus 10 Pro is our most powerful and advanced phone yet, delivering our very best user experience ever.",
        "imageUrls": [],
        "price": 749.99,
        "specifications": {
            "Screen Size": "6.7 inch Display",
            "Operating System:": "Android 12 ",
            "Internal Memory": "128 GB",
            "Phone Memory (RAM)": "8 GB",
            "Front-Facing Camera": "8 megapixels",
            "Rear-Facing Camera": "50 megapixels",
            "Processor Model ": "Snapdragon 8 Gen 1 Mobile Platform",
            "Battery Life": "Non-Removable 5000mAh",
            "color": "Volcanic Black"
        },
        "averageRating": 4.7,
        "totalRating": 344,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt1336472",
        "name": "OnePlus - Nord N20 5G - Blue Smoke (Unlocked)",
        "brand": "OnePlus",
        "category": "Smart Phones",
        "typeDescription": "Check out the all-new OnePlus Nord N20 5G, premium 5G at an amazing price! Experience the power of the largest 5G network, enabling blazing fast download and upload speeds",
        "description": "The premium 6.43” AMOLED display puts all-day immersive entertainment in the palm of your hands. Powered by a massive 4500mAh battery, the Nord N20 5G handles all your movies, TV shows, and games without breaking a sweat. With expansive 128 GB storage and excellent RAM, you’ll have all the power & space you need to run your games and apps smoothly. Take stunning photos and videos with a versatile triple-camera system. If you run out of power, get a day’s power in half an hour, with 33W fast charging. The OnePlus Nord N20 5G packs a powerful punch, making premium specs and the power of 5G more accessible than ever.",
        "imageUrls": [],
        "price": 259.99,
        "specifications": {
            "Screen Size": "6.43 inch Display",
            "Operating System:": "Android 12 ",
            "Internal Memory": "128 GB",
            "Phone Memory (RAM)": "6 GB",
            "Front-Facing Camera": "16 megapixels",
            "Rear-Facing Camera": "64 megapixels",
            "Processor Model ": "Qualcomm®️ Snapdragon™️ 695",
            "Battery Life": "Non-Removable 4500mAh",
            "color": "Volcanic Black"
        },
        "averageRating": 4.21,
        "totalRating": 455,
        "allReviews": [
            {}
        ]
    },

    {
        "id": "wt5026421",
        "name": "Redmi Note 11SE",
        "brand": "Xiaomi",
        "category": "Smart Phones",
        "typeDescription": "Redmi Note 11SE mobile was launched on 26th August 2022. The phone comes with a 6.43-inch touchscreen display offering a resolution of 1800x2400 pixels (FHD+) at a pixel density of 409 pixels per inch (ppi).",
        "description": "The display sports Gorilla Glass for protection. Redmi Note 11SE is powered by a 2.205GHz MediaTek Helio G95 processor. It comes with 6GB of RAM. The Redmi Note 11SE runs Android 11 and is powered by a 5000mAh battery.As far as the cameras are concerned, the Redmi Note 11SE on the rear packs a quad camera setup featuring a 64-megapixel (f/1.9) primary camera; an 8-megapixel (f/2.2, ultra wide-angle) camera; a 2-megapixel (f/2.4, telephoto) camera, and a 2-megapixel (f/2.4) camera. It has a single front camera setup for selfies, featuring a 13-megapixel sensor with an f/2.45 aperture.",
        "imageUrls": [],
        "price": 175.62,
        "specifications": {
            "Screen Size": "6.43 inch Display",
            "Operating System:": "Android 11 ",
            "Internal Memory": "64 GB",
            "Phone Memory (RAM)": "6 GB",
            "Front-Facing Camera": "13 megapixels",
            "Rear-Facing Camera": "64 megapixels",
            "Processor Model ": "MediaTek Helio G95",
            "Battery Life": "Non-Removable 5000mAh",
            "color": "Silver"
        },
        "averageRating": 4.2,
        "totalRating": 322,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt9561260",
        "name": "Xiaomi Poco M4 Pro 5G",
        "brand": "Xiaomi",
        "category": "Smart Phones",
        "typeDescription": "New Poco M4 Pro 5G POCO Yellow with 64GB, a 6.6-inch DynamicSwitch FHD+ display, dual speakers and 3D vibration engine",
        "description": "The Xiaomi Poco M4 Pro 5G is here! A smartphone that will offer you tons of fun through its Dimensity 810 5G processor, its 6.6-inch FHD+ display with a refresh rate of up to 90 Hz and its large battery with Pro 33W fast charging, but there's much more! Read on to learn more and discover why you should buy the Xiaomi Poco M4 Pro 5G 4GB/64GB Yellow at Powerplanetonline.Immerse yourself completely in the story of your games thanks to the X-axis linear motor of the Xiaomi Poco M4 Pro 5G, responsible for producing three-dimensional vibrations that provide super realistic and clear information, as if you were right there. In addition, the Poco M4 Pro 5G's dual speakers deliver superior sound with high-quality audio for an immersive experience, whethyou're listening to music or watching a movie.",
        "imageUrls": [],
        "price": 275.62,
        "specifications": {
            "Screen Size": "6.6 inch Display",
            "Operating System:": "Android 11 ",
            "Internal Memory": "64 GB Expandable by SD card to 1 TB",
            "Phone Memory (RAM)": "4 GB",
            "Front-Facing Camera": "16 megapixels",
            "Rear-Facing Camera": "50 megapixels",
            "Processor Model ": "MediaTek Dimensity 810",
            "Battery Life": "Non-Removable 5000mAh",
            "color": "Yellow"
        },
        "averageRating": 4.27,
        "totalRating": 222,
        "allReviews": [
            {}
        ]
    }
]