[
    {
        "id": "wt738921",
        "name": "Canon - PIXMA TR4720 Wireless All-In-One Inkjet Printer ",
        "brand": "Canon",
        "category": "Printers",
        "typeDescription": " For all your work or home printing needs, the PIXMA TR4720 Wireless* All-in-One Printer has you covered. Enjoy simple setup through the Canon PRINT Inkjet/SELPHY Ap** and an easy to install 2-Cartridge hybrid ink system and front loading 100-sheet paper tray",
        "description": "Big on performance, the PIXMA TR4720 is equipped with Auto 2-Sided Printing, an Auto Document Feeder for multi-page scanning, and built-in Fax functionality. With a variety of connectivity options, you'll be able to do it all from your PC or mobile devices— plus, the PIXMA TR4720 is compatible with Canon apps for printing, scanning, creative projects and more. Simple, productive office and home printing in a compact size— that’s the PIXMA TR4720. ",
        "imageUrls": [],
        "price": 99.99,
        "specification": {
            "Mobile Device Printing": "Yes",
            "Networking": "Wireless, Wired",
            "Printer Type": "All In One",
            "Printer Connectivity": "USB, Wi-Fi, Apple AirPrint, Mopria Print Service, Canon Mobile Printing",
            "Color": "Black",
            "Automatic Document Feeder Capacity": "20 sheets"
        },
        "averageRating": 4.25,
        "totalRating": 2134,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt566694",
        "name": "Epson - EcoTank ET-2850 All-in-One Cartridge-Free Supertank Printer",
        "brand": "Epson",
        "category": "Printers",
        "typeDescription": "Your home needs a printer that’s fast, affordable, easy to use, and has great features. That’s why we developed the EcoTank ET-2850 – an innovative cartridge-free solution that uses high-capacity,",
        "description": "easily refillable ink tanks. So you’ll worry less about running out of ink, and save a lot on replacement ink. The ET-2850 features outstanding print quality, auto-duplex printing, a high-resolution flatbed scanner, and convenient color display – making it the perfect family printer. ",
        "imageUrls": [],
        "price": 319.99,
        "specification": {
            "Mobile Device Printing": "Yes",
            "Networking": "Wireless, Wired",
            "Printer Type": "All In One, Copier, Printer",
            "Printer Connectivity": "Apple AirPrint, Epson iPrint, Google Cloud Print, Mopria Print Service, Ethernet, Wi-Fi, USB 2.0",
            "Color": "White",
            "Automatic Document Feeder Capacity": "N/A"
        },
        "averageRating": 3.25,
        "totalRating": 234,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt668347",
        "name": "Epson - WorkForce Pro WF-4820 Wireless All-in-One Printer",
        "brand": "Epson",
        "category": "Printers",
        "typeDescription": "Experience the power of high-performance business printing with the WorkForce Pro WF-4820. Providing high-speed printing, the WF-4820 blazes through high-volume print jobs at an astounding",
        "description": "25 black/12 color ISO ppm†. Built for productivity, this reliable printer consistently delivers sharp, professional-quality prints with innovative PrecisionCore Heat-Free Technology™ and vivid DURABrite® Ultra instant-dry pigment inks. An efficient, easy-to-use solution, the WF-4820 offers convenient features designed to enhance efficiency and streamline workflow, including a large, 4.3 color touchscreen for intuitive navigation, a 250-sheet paper capacity, auto 2-sided printing, wireless connectivity and more.",
        "imageUrls": [],
        "price": 189.99,
        "specification": {
            "Mobile Device Printing": "Yes",
            "Networking": "Wireless, Wired",
            "Printer Type": "All In One, Copier, Printer",
            "Printer Connectivity": "Ethernet, Wi-Fi Direct, USB, Epson iPrint",
            "Color": "Black",
            "Automatic Document Feeder Capacity": "35 sheets"
        },
        "averageRating": 4.88,
        "totalRating": 34,
        "allReviews": [
            {}
        ]
    },

    {
        "id": "wt912829",
        "name": "Epson - RapidReceipt RR-600W Wireless Receipt and Desktop Document Scanner",
        "brand": "Epson",
        "category": "Printers",
        "typeDescription": "Organizing financial paperwork and accurately processing piles of messy receipts and invoices can be a challenge. The Epson® RapidReceipt RR-600W desktop scanner was specifically designed to quickly scan stacks of invoices and receipts of varying sizes",
        "description": "then automatically and accurately process the information into smart digital assets. With the included Epson ScanSmart® financial software, you can turn stacks of unorganized receipts and invoices into categorized digital data that easily integrates into applications such as QuickBooks®, TurboTax® and more1. Plus, create searchable/editable PDFs with the included bonus software. Do it all with zero subscription fees. Featuring smart technology, this scanner learns from each receipt scanned ̶ recognizing more data and logos over time, ensuring receipts and invoices are accurately converted and categorized. And, it’s all done on your own device, giving you complete control over your data, where it’s stored and how it is used. It’s the easy, cost effective way to organize and manage your finances. ",
        "imageUrls": [],
        "price": 399.99,
        "specification": {
            "Mobile Device Printing": "N/A",
            "Networking": "N/A",
            "Printer Type": "Printer",
            "Printer Connectivity": "USB",
            "Color": "White",
            "Automatic Document Feeder Capacity": "100 sheets"
        },
        "averageRating": 3.88,
        "totalRating": 314,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt746708 ",
        "name": "Epson - RapidReceipt RR-70W Wireless Mobile Receipt and Color Document Scanner",
        "brand": "Epson",
        "category": "Printers",
        "typeDescription": "The fastest, smallest and lightest weight mobile single-sheet-fed document scanner in its class1, powered by battery or USB, the Epson® RapidReceipt RR-70W was specifically designed to quickly scan invoices and receipts of varying sizes, then automatically and accurately process the information into digital assets",
        "description": " With the included Epson ScanSmart® financial software, you can turn unorganized receipts and invoices into categorized digital data that easily integrates into applications such as QuickBooks®, TurboTax® and more2. Plus, create searchable/editable PDFs with the included bonus software. Do it all with zero subscription fees. Featuring smart technology, this scanner learns from each scan ̶ recognizing more data and logos over time, ensuring receipts and invoices are accurately converted and categorized. And, it’s all done on your own device, giving you complete control over your data, where it’s stored and how it is used. It’s the easy, cost effective way to organize and manage your finances.",
        "imageUrls": [],
        "price": 199.99,
        "specification": {
            "Mobile Device Printing": "N/A",
            "Networking": "Wired",
            "Printer Type": "Printer",
            "Printer Connectivity": "USB",
            "Color": "White",
            "Automatic Document Feeder Capacity": "1 sheet"
        },
        "averageRating": 3.88,
        "totalRating": 314,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt746708 ",
        "name": "HP - LaserJet M110we Wireless Black and White Laser Printer with 6 months of Instant Ink included with HP+ - ",
        "brand": "HP",
        "category": "Printers",
        "typeDescription": "The compact size of the HP LaserJet M110we makes it perfect for those needing to print black and white documents in small spaces.",
        "description": "Includes the HP+ Smart Printing System that keeps itself up to date, secure, and ready to print from virtually anywhere at any time. This printer only works with Original HP Toner and requires an HP account and internet connection. Includes 6 months of Instant Ink for lasers with HP+. ",
        "imageUrls": [],
        "price": 129.99,
        "specification": {
            "Mobile Device Printing": "Yes",
            "Networking": "Wireless",
            "Printer Type": "Printer",
            "Printer Connectivity": "Apple AirPrint, HP Smart, Wi-Fi, USB 2.0",
            "Color": "White",
            "Automatic Document Feeder Capacity": "150 sheet"
        },
        "averageRating": 3.22,
        "totalRating": 14,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt765164 ",
        "name": "HP - LaserJet Pro MFP 4101fdwe Wireless All-In-One Black-and-White Laser Printer with 3 mo. of Instant Ink included with HP ",
        "brand": "HP",
        "category": "Printers",
        "typeDescription": " Get ultra-fast speeds and powerful productivity with the multifunction LaserJet Pro 4101fdwe with HP+ included at no additional cost. Get laser quality black & white printing for all your business documents. Includes HP+ smart office features so you can set up and manage printers in multiple locations with a single dashboard. Never run out of toner with an optional subscription for Instant Ink for lasers.",
        "description": "Includes the HP+ Smart Printing System that keeps itself up to date, secure, and ready to print from virtually anywhere at any time. This printer only works with Original HP Toner and requires an HP account and internet connection. Includes 6 months of Instant Ink for lasers with HP+. ",
        "imageUrls": [],
        "price": 579.99,
        "specification": {
            "Mobile Device Printing": "Yes",
            "Networking": "Wireless",
            "Printer Type": "All In One",
            "Printer Connectivity": "Apple AirPrint, Bluetooth, Ethernet, HP Smart, Mopria Print Service, USB 2.0, Wi-Fi ",
            "Color": "White",
            "Automatic Document Feeder Capacity": "50 sheet"
        },
        "averageRating": 4.22,
        "totalRating": 1334,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt631766 ",
        "name": "Canon - PIXMA TS6420a Wireless All-In-One Inkjet Printer ",
        "brand": "Canon",
        "category": "Printers",
        "description":"easy to read status messages as well as Front & Rear Paper feeding so you can print on a variety of paper types. The TS6420a can handle your everyday tasks with ease from scanning an old hand-written recipe to printing crafts",
        "typeDescription": " easy to read status messages as well as Front & Rear Paper feeding so you can print on a variety of paper types. The TS6420a can handle your everyday tasks with ease from scanning an old hand-written recipe to printing crafts from the Canon Creative Park App22. Whether printing from your computer or wirelessly1 from your smartphone, the TS6420a is an effortless All-In-One Printer that fits your everyday printing needs. ",
        "imageUrls": [],
        "price": 99.99,
        "specification": {
            "Mobile Device Printing": "Yes",
            "Networking": "Wireless - Wired",
            "Printer Type": "All In One, Printer, Scanner",
            "Printer Connectivity": "Apple AirPrint, Bluetooth, Ethernet, HP Smart, Mopria Print Service, USB 2.0, Wi-Fi ",
            "Color": "Black",
            "Automatic Document Feeder Capacity": "N/A"
        },
        "averageRating": 4.88,
        "totalRating": 134,
        "allReviews": [
            {}
        ]
    }


]
