[
    {
        "id": "wt689770",
        "name": "Apple Watch Series 3 (GPS) 38mm Aluminum Case with Black Sport Band ",
        "brand": "Apple",
        "category": "Smart Watchs",
        "typeDescription": "Low and high heart rate notifications. Emergency SOS. New Breathe watch faces. Automatic workout detection. New yoga and hiking workouts.",
        "description": " Advanced features for runners like cadence and pace alerts. New head-to-head competitions. Activity sharing with friends. Personalized coaching. Monthly challenges and achievement awards. You can use Walkie-Talkie, make phone calls, and send messages. Listen to Apple Music¹ and Apple Podcasts. And use Siri in all-new ways. Apple Watch Series 3 lets you do it all right from your wrist.",
        "imageUrls": [],
        "price": 169.00,
        "specification": {
            "Screen Size:": "38 millimeters",
            "Operating System": "watchOS",
            "Internal Memory Capacity": "8 GB",
            "Sensors": "Accelerometer, Altimeter, Ambient light sensor, Gyro sensor, Heart rate sensor",
            "Color": "Space Gray",
            "Customizable Watch Faces": "Yes"
        },
        "averageRating": 4.0,
        "totalRating": 421,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt960551",
        "name": "Apple Watch Nike Series 7 (GPS) 45mm Midnight Aluminum Case with Anthracite/Black Nike Sport Band ",
        "brand": "Apple",
        "category": "Smart Watchs",
        "typeDescription": " The largest, most advanced Always-on Retina display yet makes everything you do with your Apple Watch Series 7 bigger and better. Series 7 is the most durable ",
        "description": "Apple Watch ever built, with an even more crack-resistant front crystal. Advanced features let you measure your blood oxygen level,¹ take an ECG anytime,² and access mindfulness and sleep tracking apps. You can also track dozens of workouts, including new tai chi and pilates.",
        "imageUrls": [],
        "price": 359.00,
        "specification": {
            "Screen Size:": "45 millimeters",
            "Operating System": "watchOS",
            "Internal Memory Capacity": "16 GB",
            "Sensors": " Blood oxygen, Electrocardiography, Heart rate",
            "Color": "Midnight",
            "Customizable Watch Faces": "Yes"
        },
        "averageRating": 2.4,
        "totalRating": 212,
        "allReviews": [
            {}
        ]
    }, {
        "id": "wt574781",
        "name": "Apple Watch Series 7 (GPS) 41mm Blue Aluminum Case with Abyss Blue Sport Band ",
        "brand": "Apple",
        "category": "Smart Watchs",
        "typeDescription": " The largest, most advanced Always-on Retina display yet makes everything you do with your Apple Watch Series 7 bigger and better.",
        "description": "  Series 7 is the most durable Apple Watch ever built, with an even more crack-resistant front crystal. Advanced features let you measure your blood oxygen level,¹ take an ECG anytime,² and access mindfulness and sleep tracking apps. You can also track dozens of workouts, including new tai chi and pilates..",
        "imageUrls": [],
        "price": 329.00,
        "specification": {
            "Screen Size:": "41 millimeters",
            "Operating System": "watchOS",
            "Internal Memory Capacity": "8 GB",
            "Sensors": " Blood oxygen, Electrocardiography, Heart rate",
            "Color": "Blue",
            "Customizable Watch Faces": "Yes"
        },
        "averageRating": 5.0,
        "totalRating": 21,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt128171",
        "name": "Apple Watch SE (GPS) 40mm Silver Aluminum Case with Abyss Blue Sport Band ",
        "brand": "Apple",
        "category": "Smart Watchs",
        "typeDescription": "With powerful features to help keep you connected, active, healthy, and safe, Apple Watch SE is a lot of watch. For a lot less than you expected.",
        "description": " Take calls and reply to texts, right from your wrist Track your daily activity on Apple Watch, and see your trends in the Fitness app on iPhone Track new tai chi and Pilates workouts, in addition to favorites like running, yoga, swimming, and dance  Hike smarter with built-in compass and real-time elevation readings Stay on top of your health with high and low heart rate, and irregular heart rhythm notifications¹ Apple Watch can detect if you've taken a hard fall, then automatically call emergency services for you² Emergency SOS lets you call for help when you need it³ Sync your favorite music, podcasts, and audiobooks Make purchases instantly and securely from your wrist with Apple Pay Swim proof design⁴ 100% recycled aluminum cases available in three finishes",
        "imageUrls": [],
        "price": 249.00,
        "specification": {
            "Screen Size:": "40 millimeters",
            "Operating System": "watchOS",
            "Internal Memory Capacity": "32 GB",
            "Metrics Measured": " Activity vs. inactivity, Altitude changes, Cadence, Calories burned, Electrocardiography, Heart rate, Hours slept, Pace",
            "Color": "Silver",
            "Customizable Watch Faces": "Yes"
        },
        "averageRating": 3.0,
        "totalRating": 132,
        "allReviews": [
            {}
        ]
    },

    {
        "id": "wt469673",
        "name": "Samsung - Galaxy Watch4 Aluminum Smartwatch 40mm BT",
        "brand": "Samsung",
        "category": "Smart Watchs",
        "typeDescription": "Crush workouts and all your health goals with Samsung Galaxy Watch4. Be your best with the watch that knows you best.",
        "description": " Body Composition Analysis Get ready to crush your wellness goals with body readings right on your wrist. Advanced Sleep / Continuous SpO2Manage your overall sleep quality for a great night's sleep with an advanced tracker that calculates your sleep score. ECG Be smart about your heart with ECG Monitoring that gives accurate readings.Fitness / Auto Workout Tracking Make the most of every workout with Auto Workout Tracking. Stay motivated by connecting to live coaching sessions via your smartphone or to dynamic Group Challenges with your friends. V02 Max / Advanced Run Coaching Make the most out of every mile with Advanced Run Coaching and VO2 max readings to assess your cardio levels.Extension of Your PhoneStay in stride while staying connected to calls, text and music on the go.",
        "imageUrls": [],
        "price": 179.99,
        "specification": {
            "Screen Size:": "40 millimeters",
            "Operating System": "Android",
            "Metrics Measured": "Blood oxygen, Blood pressure, Electrocardiography, Heart rate",
            "Sensors": " Accelerometer, Barometer, Gyro sensor, Geomagnetic sensor, Ambient light sensor, Heart rate sensor",
            "Color": "Pink",
            "Customizable Watch Faces": "Yes"
        },
        "averageRating": 4.3,
        "totalRating": 328,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt294488",
        "name": "Samsung - Galaxy Watch5 Pro Titanium Smartwatch",
        "brand": "Samsung",
        "category": "Smart Watchs",
        "typeDescription": "Take on your ultimate adventure with Galaxy Watch5 Pro¹. It’s our most advanced outdoor watch yet, featuring a 2x stronger⁵ Sapphire Crystal Glass display. . ",
        "description": " Power through intense activities, even with GPS on, with a long-lasting battery. Stay on the right trail even in unfamiliar terrain thanks to voice or vibration guided turn-by-turn navigation⁹. Push your body further with accurate sensors that help keep a closer eye on your heart rate³, and BIA² measurements that help you track your physique. Get the rest you need to stay energized on your journeys with Advanced Sleep Coaching¹. Look sharp on every expedition with bands and watch faces that you can match to any outfit. Plus, pair your watch with the rest of your Galaxy for a connected network of devices that work together to help go stronger and harder than ever before. Whether you’re hiking, kayaking⁴ or camping, get ready to take it to the extreme with Galaxy Watch5 Pro..",
        "imageUrls": [],
        "price":449.99,
        "specification": {
            "Screen Size:": "45 millimeters",
            "Operating System": "Android",
            "Metrics Measured": "Blood oxygen, Electrocardiography, Glucose, Heart rate, Hours slept",
            "Sensors": " Accelerometer, Barometer, Gyro sensor, Geomagnetic sensor, Ambient light sensor, Heart rate sensor",
            "Color": "Black",
            "Customizable Watch Faces": "Yes"
        },
        "averageRating": 2.0,
        "totalRating": 321,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt422238",
        "name": "Samsung - Gear S3 Classic Smartwatch 46mm Stainless Steel Verizon ",
        "brand": "Samsung",
        "category": "Smart Watchs",
        "typeDescription": "Bring the classic style of a watch into the 21st century with this Samsung Gear S3 Classic smartwatch. Ease of use combines with smart aesthetics to make it simple to operate, and the ultralong battery life means you won't have to charge it for days. Keep track of all your stats with ease using this Samsung gear S3 Classic smartwatch.",
        "description": " Android and iOS compatible Samsung Gear S3 is compatible with both Android and iOS smartphones.¹Never miss a moment  Text, call, and get notifications directly from your Bluetooth-connected watch.¹Pay with your watch Make payments with Samsung Pay almost anywhere you can swipe or tap a credit card.² Get out thereThe built-in GPS keeps track of your activity and makes it easy to share your location. Designed for the elements With military-grade performance, the Gear S3 resists water, dust, extreme temperatures, and occasional drops.³Apps at every turn Rotate the distinctive steel bezel to easily access apps and notifications. Go for daysGo nonstop for days on a single charge⁴ and recharge on the wireless charger.",
        "imageUrls": [],
        "price":399.9,
        "specification": {
            "Screen Size:": "33 millimeters",
            "Operating System": "Tizen",
            "Metrics Measured": "Activity vs. inactivity, Heart rate, Sleep quality, Steps taken",
            "Sensors": "Accelerometer, Ambient light sensor, Barometer, Gyro sensor, Heart rate sensor",
            "Color": "Silver",
            "Customizable Watch Faces": "N/A"
        },
        "averageRating": 3.20,
        "totalRating": 426,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt182640",
        "name": "Garmin - Forerunner 45 GPS Smartwatch 42mm Fiber-Reinforced Polymer",
        "brand": "Garmin",
        "category": "Smart Watchs",
        "typeDescription": "Find your way while training with this Garmin Forerunner 45 GPS black running watch. The battery lasts up to 13 hours when the GPS is active to accommodate long training sessions. This Garmin Forerunner 45 GPS black running watch has a large digital display that makes information easy to read at a glance.",
        "description": " Wellness tracking Wear this Forerunner running watch 24/7 to monitor daily steps, distance, calories burned, all-day stress, and even sleep Safety and tracking This watch includes incident detection (during select activities) and assistance, which both send your real-time location to emergency contacts. Live tracking allows family and friends to follow your progress.¹24/7 heart rate monitoring The Elevate™ wrist-based heart rate technology monitors heart rate all day and night with no additional straps required.²",
        "imageUrls": [],
        "price":139.99,
        "specification": {
            "Screen Size:": "26.3 millimeters",
            "Operating System": "Garmin",
            "Metrics Measured": "Activity vs. inactivity, Altitude changes, Cadence, Calories burned, Cycling speed, Distance traveled, Heart rate, Pace, Route, Speed, Steps taken",
            "Sensors": "Accelerometer, Heart rate sensor",
            "Color": "Black",
            "Customizable Watch Faces": "N/A"
        },
        "averageRating": 4.2,
        "totalRating": 18,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt326191",
        "name": "Garmin - Instinct GPS Smartwatch 45mm Fiber-Reinforced Polymer",
        "brand": "Garmin",
        "category": "Smart Watchs",
        "typeDescription": "Track your heart rate and exercise with this Garmin GPS watch. It has activity profiles installed to help you plan workouts, and it's water-resistant up to 100m for swimming. This Garmin GPS watch has a battery life of 14 days in smart watch mode so you can wait longer between charges.",
        "description": " Wellness tracking Wear this Forerunner running watch 24/7 to monitor daily steps, distance, calories burned, all-day stress, and even sleep Safety and tracking This watch includes incident detection (during select activities) and assistance, which both send your real-time location to emergency contacts. Live tracking allows family and friends to follow your progress.¹24/7 heart rate monitoring The Elevate™ wrist-based heart rate technology monitors heart rate all day and night with no additional straps required.²",
        "imageUrls": [],
        "price":179.99,
        "specification": {
            "Screen Size:": "23 millimeters",
            "Operating System": "Garmin",
            "Metrics Measured": "Activity vs. inactivity, Calories burned, Distance traveled, Heart rate, Speed, Stairs climbed, Steps taken",
            "Sensors": "Accelerometer, Altimeter, Compass, Heart rate sensor, Temperature sensor",
            "Color": "Graphite",
            "Customizable Watch Faces": "N/A"
        },
        "averageRating": 2.0,
        "totalRating": 154,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt481314",
        "name": "Garmin - Forerunner 35 GPS Watch",
        "brand": "Garmin",
        "category": "Smart Watchs",
        "typeDescription": "Stay active when you wear the Garmin Forerunner 35 GPS running watch. Smart connectivity lets you control your music and upload your workout results.",
        "description": "and the activity tracking feature counts steps taken and calories burned. Boasting a high resolution display, the Garmin Forerunner 35 GPS running watch makes your heart rate, running time and step count easy to see.",
        "imageUrls": [],
        "price":119.99,
        "specification": {
            "Screen Size:": "23 millimeters",
            "Operating System": "Garmin",
            "Metrics Measured": "Calories burned, Distance traveled, Heart rate, Steps taken",
            "Sensors": "Accelerometer, Heart rate sensor",
            "Color": "Frost blue",
            "Customizable Watch Faces": "N/A"
        },
        "averageRating": 4.5,
        "totalRating": 154,
        "allReviews": [
            {}
        ]
    }
 
]