[
    {
        "id": "wt3483838228",
        "name": "Sky 32Inch Android Smart HD Digital Satellite Receiver LED TV - Black",
        "brand": "Sky",
        "category": "Smart TVs",
        "typeDescription": "LED technology is what is among the best technologies currently on the market",
        "description": "In addition to using the latest technology to screen material, Sky TV offers a quality/price ratio unbeatable by TVs competing for brands in the same category. Sky TVs have the best TV aspect ratio, adjustable contrast and brightness features to complement picture quality when watching movies.",
        "imageUrls": [],
        "price": 140.54,
        "specification": {
            "Screen Size:": "32 inch",
            "Screen Type": "LED",
            "Screen Resolution": "1920 x 1080 Pixels",
            "Connectivity": "Headphone Jack 1, USB 2, HDMI 3",
            "Color": "black",
            "Main Material": "N/A"
        },
        "averageRating": 2.0,
        "totalRating": 43,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt3483838118",
        "name": "Hisense 40 Smart TV, Stream YouTube & Netflix + Free Wall Mount Bracket - Black",
        "category": "Smart TVs",
        "brand": "Hisense",
        "typeDescription": "HISENSE SMART 40  INCH TELEVISION + FREE WALL BRACKET.￼Smart because it's easier, faster and a more intelligent way to surf content on a single device or across multiple devices.",
        "description": "hisense  Smart TVs contain upgraded functions designed with rich content to complete suit your lifestyle. As one of the world’s leading internet television with a huge range of popular content, Netflix has something for everyone. You can watch TV shows recommended just for you, including award-winning Netflix  series, movies, and documentaries.",
        "imageUrls": [],
        "price": 248.18,
        "specification": {
            "Screen Size:": "40 inches",
            "Screen Type": "LED",
            "Screen Resolution": "1920 x 1080 Pixels",
            "Connectivity": " Headphone: 1, USB 2, HDMI 2",
            "Color": "black",
            "Main Material": "N/A"
        },
        "averageRating": 3.60,
        "totalRating": 4564,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt3483838222",
        "name": "Hisense 32 Smart TV with Ready Internet on YouTube, Netflix, USB & HDMI Ports, Inbuilt Digital Free to Air Decoder - Black",
        "category": "Smart TVs",
        "brand": "Hisense",
        "typeDescription": "I’m smart and smoothThe 1080p resolution on the Hisense  Series Full HD Smart TV delivers ja stunning picture quality that just might make you the most popular host on the block",
        "description": "Watch premium content from Netflix, YouTube, Amazon Video, TikiLive, FandangoNow, listen to your favorite music from Pandora and iHeartRadio with built-in apps. Use your mobile device to share your vacation photos on the TV, download more apps from the store, or browse the web from your couch. Basically, the Hisense Series does way more than you thought a TV was capable of.",
        "imageUrls": [],
        "price": 171.68,
        "specification": {
            "Screen Size:": "32 inches",
            "Screen Type": "LED",
            "Screen Resolution": "1920 x 1080 Pixels",
            "Connectivity": " HDMI, USB & AV Input",
            "Color": "black",
            "Main Material": "N/A"
        },
        "averageRating": 3.30,
        "totalRating": 31,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt3483838223",
        "name": "Sky Digital LED TV 40 inch High Definition Picture, With 2 Remotes - Black",
        "category": "Smart TVs",
        "brand": "Sky",
        "typeDescription": "LED Technology LED technology is what is among the best technologies currently on the market.In addition to using the latest technology to screen material",
        "description": "Sky TV offers a quality/price ratio unbeatable by TVs competing for brands in the same category. Sky TVs have the best TV aspect ratio, adjustable contrast and brightness features to complement picture quality when watching movies.",
        "imageUrls": [],
        "price": 186.09,
        "specification": {
            "Screen Size:": "40 inches",
            "Screen Type": "LED",
            "Screen Resolution": "1920 x 1080 Pixels",
            "Connectivity": "Headphone Jack 1, USB 2, HDMI 3",
            "Color": "black",
            "Main Material": "N/A"
        },
        "averageRating": 3.40,
        "totalRating": 114,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt7779992",
        "name": "Saachi 40 Inch Digital LED TV - Black Free to Air",
        "category": "Smart TVs",
        "brand": "Saachi",
        "typeDescription": "Enjoy high definition images with surround sound audio. With its superb combination of great technologies and modern design",
        "description": "Saachi ED Full HD TV offers enriched viewing of your favorite shows and movies on television.Standing tall at 40 inches and offering a resolution of 1920 x 1080, enhanced viewing experience that will a sure treat to your eyes, elevate your cinematic experience at home to a whole new level with its full HD feature giving you viewing experience that is truly pleasurable.",
        "imageUrls": [],
        "price": 168.43,
        "specification": {
            "Screen Size:": "40 inches",
            "Screen Type": "LED",
            "Screen Resolution": "1920 x 1080 Pixels",
            "Connectivity": "USB 1, HDMI 2",
            "Color": "black",
            "Main Material": "Plastic"
        },
        "averageRating": 4.03,
        "totalRating": 876,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt7661172",
        "name": "Saachi 32 inch Digital Frameless Pure View Tv With Inbuilt Decoder - Black",
        "category": "Smart TVs",
        "brand": "Saachi",
        "typeDescription": "The 32 backlit LED panel of the television produces eye catching HD resolution images that are simply stunning to look at. This TV also has a number of ports to keep you well connected at all times,",
        "description": "32 LED Displays the Saachi 32 inch HD LED TV’s makes a perfect addition to contemporary rooms. When switched on, the backlit LED screen churns out images and videos with amazing contrast and details. High Definition TV. The Hisense 32 HD LED display generates amazingly clear, razor sharp images with a resolution of full HD. More over, it comes with the latest DVB-T2 technology for the best & clearest digital TV signals so you can enjoy in-built free local TV channels off the box.",
        "imageUrls": [],
        "price": 117.42,
        "specification": {
            "Screen Size:": "32 inches",
            "Screen Type": "LED",
            "Screen Resolution": "1920 x 1080 Pixels",
            "Connectivity": "HDMI: 2 - USB: 1 - Optical Output: 1 - Audio Jack: 1 - AV Input: 1",
            "Color": "black",
            "Main Material": "N/A"
        },
        "averageRating": 3.0,
        "totalRating": 488,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt1953167",
        "name": "40 LED TV Free To Air Inbuilt Decoder - Black",
        "category": "Smart TVs",
        "brand": "Uknown",
        "typeDescription": "The Ultra Clear video processor engine includes successful color-turning tools and a multi-dimensional color/sharpening/NR formula that can quickly reflect subtle changes in darker, brighter, or mixed scenes.",
        "description": "Enjoy clear pictures at the comfort of your couch or seat or bed and watch your favorite TV programme and once you don't find that enticing enough, the TV is equipped with a variety of multimedia features for your overall entertainment.",
        "imageUrls": [],
        "price": 219.12,
        "specification": {
            "Screen Size:": "40 inches",
            "Screen Type": "DLED",
            "Screen Resolution": "1920 x 1080 Pixels",
            "Connectivity": "3 HDMI Inputs - MHL Compatible - USB INPUT",
            "Color": "black",
            "Main Material": "Plastic"
        },
        "averageRating": 4.60,
        "totalRating": 441,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt3448446",
        "name": "LG 43LM5500PVA LG 43 Inch Digital TV - Black",
        "brand": "LG",
        "category": "Smart TVs",
        "typeDescription": "A New Level of Full-HDA full HD screen delivers more accurate images in stunning resolution and vivid color.",
        "description": "Dynamic Color EnhancerThe advanced image processor adjusts color for richer, more natural images.Enjoy thebeauty of nature’s true colors on your TV screen.TV-FHD-32-LM63-02-Dynamic-Color-Desktop_v1 Quad Core Processor, The Origin of Lifelike ImagesFour fast, accurate processors eliminate noise and create more dynamic color and contrast. Low-resolution images are up-scaled and reproduced as sharper, more vivid images.TV-FHD-32-LM63-03-Quad-Core-Processor-Desktop_v1",
        "imageUrls": [],
        "price": 428.19,
        "specification": {
            "Screen Size:": "43 inches",
            "Screen Type": "LED",
            "Screen Resolution": "1920 x 1080 Pixels",
            "Connectivity": "HDMI: 2 (Rear)/1 (Side) - USB: 2 (Side)",
            "Color": "black",
            "Main Material": "Plastic"
        },
        "averageRating": 3.20,
        "totalRating": 27,
        "allReviews": [
            {}
        ]
    },
    {
        "id": "wt1084779 ",
        "name": "LG 65UK6400PVC LG 65 Inch 4K Smart TV - Black",
        "brand": "LG",
        "category": "Smart TVs",
        "typeDescription": "High-Resolution for a razor sharp imageThe higher the resolution, the greater the image detail. LG UHD TV has four times the resolution of a Full HD TVs. It means you are getting 4 times clarity.",
        "description": "Consistent images at any angleLG UHD TV maintains more precise color and allows everyoneto enjoy the magnificent picture no matter where they sit.The core of authentic imageQuad core processor works tirelessly to reduce distracting noise, enhance sharpness even while upscaling lower-resolution images to near 4K picture quality.",
        "imageUrls": [],
        "price": 1441.56,
        "specification": {
            "Screen Size:": "65 inches",
            "Screen Type": "LED",
            "Screen Resolution": "4K Active HDR for a life like scene",
            "Connectivity": "HDMI: 2 (Rear)/1 (Side) - USB: 2 (Side)",
            "Color": "black",
            "Main Material": "Plastic"
        },
        "averageRating": 3.20,
        "totalRating": 67,
        "allReviews": [
            {}
        ]
    }
]